#include <iostream>
using namespace std;
    // طباعة  الاسم
int main() {
    cout<< "               الطاهر عباس احمد"<<endl;
    
// متغير لتخزين الاسم
   string name; 
  // متغير لتخزين العمر
    int age;            
 // متغير لتخزين النوع
   string gender; 
   
    // طلب إدخال الاسم
    std::cout << "مرحبًا عزيزي👋 الرجاء,\n إدخال اسمك: ";
    cin>> name;

    // رسالة ترحيبية 
    cout << "مرحبًا بك! أكمل باقي الخطوات المتبقية.\n";

    // طلب إدخال العمر
     cout << "الرجاء إدخال عمرك: ";
      cin >> age;

    // طلب إدخال النوع
     cout << "الرجاء إدخال النوع (ذكر ): ";
     cin >> gender;

    // رسالة التأكيد
     cout << "أنت مؤهل لهذه الوظيفة✨☑️💥!" << std::endl;

    return 0;
}
